app/views/lists/show.html.erb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."list_id" = $1  [["list_id", 1]]
---
<h2>Movies in this List</h2>
<div class="row">  <% @list.bookmarks.each do |bookmark| %>