app/controllers/bookmarks_controller.rb

  def new
    @bookmark = Bookmark.new
    @movies = Movie.all
---
SELECT "movies".* FROM "movies"

  def index
    @bookmarks = Bookmark.all
---
SELECT "bookmarks".* FROM "bookmarks"

  def create
    @bookmark = Bookmark.new(bookmark_params)
    @bookmark.list = @list
    if @bookmark.save
---
INSERT INTO "bookmarks" ("comment", "movie_id", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "Romantic movie"], ["movie_id", 3], ["list_id", 1], ["created_at", "2024-02-22 14:57:56.087406"], ["updated_at", "2024-02-22 14:57:56.087406"]]

  def destroy
    @bookmark = Bookmark.find(params[:id])
    @bookmark.destroy
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 26]]

  def set_list
    @list = List.find(params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]